rheoTool/tutorials/rheoEFoam/ICEO/PoissonBoltzmann/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rheoEFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.15;

deltaT          2e-5;  

writeControl    runTime;

writeInterval   0.03;

purgeWrite      0;

writeFormat     ascii;

writePrecision  12;

writeCompression compressed;

timeFormat      general;

timePrecision   10;

graphFormat     raw;

runTimeModifiable yes;

adjustTimeStep off;

maxCo          0.1;

maxDeltaT      0.01;

functions
{
    probes
    {
        // Where to load it from
        functionObjectLibs ( "libsampling.so" );

        type            probes;

        // Name of the directory for probe data
        name            probes;

        // Write at same frequency as fields
        writeControl   timeStep;
        writeInterval  50;

        // Fields to be probed
        fields
        (
            U
        );

        probeLocations
        (
            (2e-5 2e-5 5e-6)    
        );
    }

}

// ************************************************************************* //
