rheoTool/tutorials/rheoEFoam/ICEO/PoissonBoltzmann/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    elecNorth
    {
	type            fixedValue;
	value           uniform (0 0 0);    
    }
   
    elecSouth
    {
	type            fixedValue;
	value           uniform (0 0 0);     
    }
    
    cylinder
    {
	type            fixedValue;
	value           uniform (0 0 0);
    }

    "wall.*"
    {
	type            fixedValue;
	value           uniform (0 0 0);     
    }

    frontAndBack
    {
	type            empty;     
    }
}

// ************************************************************************* //
