rheoTool/tutorials/rheoEFoam/ICEO/PoissonBoltzmann/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    elecNorth
    {
	type            zeroGradient;      
    }
   
    elecSouth
    {
	type            zeroGradient;        
    }
    
    cylinder
    {
	type            zeroGradient;    
    }

    "wall.*"
    {
	type            zeroGradient;    
    }

    frontAndBack
    {
	type            empty;     
    }
}

// ************************************************************************* //
